package hw5;

import hw4.Main;

public class Task2 {
/*Лабиринт задан квадратной матрицей А. Аk = 0, если клетка "проходима"; Аk = 1, если клетка "непроходима".
Начальное положение путника задается в проходимой клетке А = 0.
Путник может перемещаться из одной проходимой клетки в другую, если они имеют общую сторону.
Путник выходит из лабиринта, когда попадает в граничную клетку. Может ли путник выйти из лабиринта?
Если может, то напечатать путь от выхода (в виде координат точек на маршруте) до начального положения путника.
Путь должен иметь минимальную длину.*/

    public static void main() {
        System.out.println("Введите натуральное число");
             Main.menu();
    }
}
